# MacroManager Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIMacroManager..::..MacroManager Property
UIMacroManager Class See Also
---
The DB macro manager.
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroManager MacroManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MacroManager As MacroManager
	Get
```

Visual C++
---
```text
public:
property MacroManager^ MacroManager {
	MacroManager^ get ();
}
```

# See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace